In [1]:
people = {
    "first":['Ali','Jane','Jhon'],
    "last":['Raza','Doe','Doe'],
    "email":['aliraza@gmail.com','janeDoe@gmail.com','JhonDoe@hotmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first  last                email
0   Ali  Raza    aliraza@gmail.com
1  Jane   Doe    janeDoe@gmail.com
2  Jhon   Doe  JhonDoe@hotmail.com

In [5]:
df.columns = ['first_name','last_name','email']

In [6]:
df

  first_name last_name                email
0        Ali      Raza    aliraza@gmail.com
1       Jane       Doe    janeDoe@gmail.com
2       Jhon       Doe  JhonDoe@hotmail.com

In [7]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                EMAIL
0        Ali      Raza    aliraza@gmail.com
1       Jane       Doe    janeDoe@gmail.com
2       Jhon       Doe  JhonDoe@hotmail.com

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                email
0        Ali      Raza    aliraza@gmail.com
1       Jane       Doe    janeDoe@gmail.com
2       Jhon       Doe  JhonDoe@hotmail.com

In [9]:
df.rename(columns = {'first_name':'first', 'last_name':'last'}, inplace = True)
df

  first  last                email
0   Ali  Raza    aliraza@gmail.com
1  Jane   Doe    janeDoe@gmail.com
2  Jhon   Doe  JhonDoe@hotmail.com

In [10]:
df.loc[2] = ['Jhon','Smith','JhonSmith@email.com']

In [11]:
df.loc[2]

first                   Jhon
last                   Smith
email    JhonSmith@email.com
Name: 2, dtype: object

In [12]:
df.loc[2,['last','email']] = ['Doe','jhondoe@gmail.com']

In [13]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janeDoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

In [14]:
df['email']= df['email'].str.lower()

In [15]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janedoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

### apply

In [16]:
df['email'].apply(len)

0    17
1    17
2    17
Name: email, dtype: int64

In [17]:
def update_email(email):
    return email.upper()

In [18]:
df['email'].apply(update_email)

0    ALIRAZA@GMAIL.COM
1    JANEDOE@GMAIL.COM
2    JHONDOE@GMAIL.COM
Name: email, dtype: object

In [19]:
df['email'] = df['email'].apply(update_email)

In [20]:
df

  first  last              email
0   Ali  Raza  ALIRAZA@GMAIL.COM
1  Jane   Doe  JANEDOE@GMAIL.COM
2  Jhon   Doe  JHONDOE@GMAIL.COM

In [21]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [22]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janedoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

In [23]:
df.apply(pd.Series.min)

first                  Ali
last                   Doe
email    aliraza@gmail.com
dtype: object

In [24]:
df.apply(lambda x: x.min())

first                  Ali
last                   Doe
email    aliraza@gmail.com
dtype: object

In [32]:
# Series Object Don't have 'applymap' method. i.e

df.apply(len)

first    3
last     3
email    3
dtype: int64

### applymap

In [26]:
df.applymap(len)

   first  last  email
0      3     4     17
1      4     3     17
2      4     3     17

In [31]:
df.applymap(str.lower)

  first  last              email
0   ali  raza  aliraza@gmail.com
1  jane   doe  janedoe@gmail.com
2  jhon   doe  jhondoe@gmail.com

### map

In [35]:
df

  first  last              email
0   Ali  Raza  aliraza@gmail.com
1  Jane   Doe  janedoe@gmail.com
2  Jhon   Doe  jhondoe@gmail.com

In [36]:
df['first'].map({'Ali':'Ahmad','Jane':'Koe'})

0    Ahmad
1      Koe
2      NaN
Name: first, dtype: object

In [37]:
# In order to avoid 'NaN' we can still change the only values we want by 'replace' method. i.e

### replace

In [38]:
df['first'].replace({'Ali':'Ahmad','Jane':'Koe'})

0    Ahmad
1      Koe
2     Jhon
Name: first, dtype: object